In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
d = pd.Series([4,8,15,16,23,42])
d

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
var = [1,2,3,4,5,6,7,8,9,0]
d = pd.Series(var)
d

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female
Then, print the DataFrame.

In [5]:
data = {"Name":['Alice' , 'Bob' , 'Claire'],
       "Age": [25,30,27],
       "Gender":['Female', 'Male', 'Female']
       }
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [14]:
#A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
#but pandas.series is a 1 dimensional data structure which contain a single row or column.

#Example of DataFrame 
data = {"Name":['Alice' , 'Bob' , 'Claire'],
       "Age": [25,30,27],
       "Gender":['Female', 'Male', 'Female']
       }
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [15]:
#Example of pandas.series
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [16]:
# some common functions that we use to manipulate date in a pandas DataFrame are---
# min(),max(),mean(),mode(),median(),sum(),var() etc.
# some Examples are--
data1 = {"a":[1,2,3,4,5],
        "b":[6,7,8,9,1]}
df = pd.DataFrame(data1)
df

   a  b
0  1  6
1  2  7
2  3  8
3  4  9
4  5  1

In [17]:
df['a'].max()

5

In [18]:
df['a'].min()

1

In [19]:
df['a'].mean()

3.0

In [20]:
df['a'].mode()

0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int64

In [22]:
df['a'].median()

3.0

In [23]:
df['a'].sum()

15

In [24]:
df['a'].var()

2.5

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [25]:
#Series--> immutable
#DataFrame--> mutable
#Panel--> mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
a = pd.Series([1,2,3,4,5])
b = pd.Series([6,7,8,9,2])
df = pd.concat([a,b],axis = 1)
df

   0  1
0  1  6
1  2  7
2  3  8
3  4  9
4  5  2